; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v4 - type_2 ?v3 - type_1)
 	      (pred_1 ?v6 - object ?v3 - type_1)
	      (pred_2 ?v4 - type_2 ?v1 - type_3)
	      (pred_3 ?v4 - type_2 ?v6 - object ?v1 - type_3))

   (:action op_3
       :parameters  (?v4 - type_2 ?v5 ?v7 - type_1)
       :precondition (and  (pred_4 ?v4 ?v5))
       :effect (and  (pred_4 ?v4 ?v7)
		     (not (pred_4 ?v4 ?v5))))

   (:action op_2
       :parameters (?v4 - type_2 ?v8 - object ?v2 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v8 ?v2) (pred_4 ?v4 ?v2) (pred_2 ?v4 ?v1))
       :effect (and (pred_3 ?v4 ?v8 ?v1)
		    (not (pred_1 ?v8 ?v2)) 
		    (not (pred_2 ?v4 ?v1))))

   (:action op_1
       :parameters (?v4 - type_2 ?v8 - object ?v2 - type_1 ?v1 - type_3)
       :precondition  (and  (pred_3 ?v4 ?v8 ?v1) (pred_4 ?v4 ?v2))
       :effect (and (pred_1 ?v8 ?v2)
		    (pred_2 ?v4 ?v1)
		    (not (pred_3 ?v4 ?v8 ?v1)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_04 obj_13 - type_2
obj_09 obj_08 obj_06 obj_03 - type_3
obj_10 obj_11 obj_07 obj_02 - type_1
obj_05 obj_12 obj_01 - object)
(:init
(pred_4 obj_04 obj_10)
(pred_2 obj_04 obj_09)
(pred_2 obj_04 obj_08)
(pred_4 obj_13 obj_10)
(pred_2 obj_13 obj_06)
(pred_2 obj_13 obj_03)
(pred_1 obj_05 obj_10)
(pred_1 obj_12 obj_07)
(pred_1 obj_01 obj_10)
)
(:goal
(and
(pred_1 obj_05 obj_07)
(pred_1 obj_12 obj_02)
(pred_1 obj_01 obj_10)
)
)

(:constraints
  (always (not (pred_4 obj_04 obj_07)))
)
)

; plan
1. (op_2 obj_04 obj_05 obj_10 obj_08)
   deleted: (pred_1 obj_05 obj_10) (pred_2 obj_04 obj_08)
   added: (pred_3 obj_04 obj_05 obj_08)
   goals met: 1 of 3
2. (op_3 obj_13 obj_10 obj_07)
   deleted: (pred_4 obj_13 obj_10)
   added: (pred_4 obj_13 obj_07)
   goals met: 1 of 3
3. (op_2 obj_13 obj_12 obj_07 obj_03)
   deleted: (pred_1 obj_12 obj_07) (pred_2 obj_13 obj_03)
   added: (pred_3 obj_13 obj_12 obj_03)
   goals met: 1 of 3
4. (op_3 obj_04 obj_10 obj_02)
   deleted: (pred_4 obj_04 obj_10)
   added: (pred_4 obj_04 obj_02)
   goals met: 1 of 3
5. (op_3 obj_13 obj_07 obj_02)
   deleted: (pred_4 obj_13 obj_07)
   added: (pred_4 obj_13 obj_02)
   goals met: 1 of 3
6. (op_1 obj_04 obj_05 obj_02 obj_08)
   deleted: (pred_3 obj_04 obj_05 obj_08)
   added: (pred_1 obj_05 obj_02) (pred_2 obj_04 obj_08)
   goals met: 1 of 3
7. (op_1 obj_13 obj_12 obj_02 obj_03)
   deleted: (pred_3 obj_13 obj_12 obj_03)
   added: (pred_1 obj_12 obj_02) (pred_2 obj_13 obj_03)
   goals met: 2 of 3
8. (op_2 obj_13 obj_05 obj_02 obj_03)
   deleted: (pred_1 obj_05 obj_02) (pred_2 obj_13 obj_03)
   added: (pred_3 obj_13 obj_05 obj_03)
   goals met: 2 of 3
9. (op_3 obj_13 obj_02 obj_07)
   deleted: (pred_4 obj_13 obj_02)
   added: (pred_4 obj_13 obj_07)
   goals met: 2 of 3
10. (op_1 obj_13 obj_05 obj_07 obj_03)
   deleted: (pred_3 obj_13 obj_05 obj_03)
   added: (pred_1 obj_05 obj_07) (pred_2 obj_13 obj_03)
   goals met: 3 of 3
